# Resumen Detallado: Tutoría de Planificación y Administración de Redes (14/05/2025)

## 1. Configuración de VLANs en Switches Cisco

### Continuación de la práctica de VLANs
La sesión comenzó retomando la configuración de VLANs iniciada en la clase teórica. Los estudiantes ya habían creado las VLANs 10 y 20 en un switch y ahora procedieron a completar la configuración:

#### Esquema de direccionamiento IP
- **VLAN 10**: Red 192.168.10.0/24
  - PC1-VLAN10: 192.168.10.2 (Gateway: 192.168.10.1)
  - PC2-VLAN10: 192.168.10.3 (Gateway: 192.168.10.1)
- **VLAN 20**: Red 192.168.20.0/24
  - PC1-VLAN20: 192.168.20.2 (Gateway: 192.168.20.1)
  - PC2-VLAN20: 192.168.20.3 (Gateway: 192.168.20.1)

#### Asignación de puertos a VLANs
Se asignaron rangos específicos de puertos para cada VLAN:
```
Switch# configure terminal
Switch(config)# interface range fa0/1-9
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 10
Switch(config-if-range)# exit
Switch(config)# interface range fa0/10-20
Switch(config-if-range)# switchport mode access
Switch(config-if-range)# switchport access vlan 20
Switch(config-if-range)# exit
```

### Verificación del estado de las VLANs
El profesor mostró cómo verificar la configuración de VLANs mediante el comando:
```
Switch# show vlan brief
```
Este comando muestra una tabla con las VLANs configuradas, sus nombres y los puertos asignados a cada una.

### Pruebas de conectividad
Se realizaron pruebas para demostrar el aislamiento entre VLANs:
1. **Conectividad entre equipos de la misma VLAN**: Los equipos dentro de la misma VLAN pueden comunicarse entre sí sin problemas.
2. **Aislamiento entre VLANs**: Se confirmó que equipos en diferentes VLANs no pueden comunicarse, aunque estén conectados al mismo switch físico.
3. **Prueba de conexión incorrecta**: Se mostró que si un dispositivo con dirección IP de VLAN 20 se conecta a un puerto configurado para VLAN 10, no podrá comunicarse con ningún dispositivo.

## 2. Configuraciones de seguridad en el switch

### Protección de acceso a la consola
Se configuró una contraseña para proteger el acceso a la consola del switch:
```
Switch# configure terminal
Switch(config)# line console 0
Switch(config-line)# password cisco123
Switch(config-line)# login
Switch(config-line)# exit
```

### Encriptación de contraseñas
Se explicó la importancia de encriptar las contraseñas en la configuración:
```
Switch# configure terminal
Switch(config)# service password-encryption
```

El profesor demostró cómo verificar que las contraseñas estaban encriptadas mediante el comando:
```
Switch# show running-config
```

### Asignación de nombre al switch
Se configuró un nombre descriptivo para el switch:
```
Switch# configure terminal
Switch(config)# hostname SW_DP1
```

## 3. Comunicación entre switches

### Problema de comunicación entre VLANs en diferentes switches
Se demostró que aunque dos switches tengan configuradas las mismas VLANs, los dispositivos en la misma VLAN pero en diferentes switches no pueden comunicarse automáticamente.

### Configuración de enlaces troncales (trunk)
El profesor comenzó a explicar la configuración de enlaces troncales, que permiten transportar tráfico de múltiples VLANs entre switches:
```
Switch# configure terminal
Switch(config)# interface fa0/21
Switch(config-if)# switchport mode trunk
```

Se explicó que en el otro extremo también debe configurarse como troncal:
```
Switch2# configure terminal
Switch2(config)# interface fa0/1
Switch2(config-if)# switchport mode trunk
```

### Importancia de la asignación de puertos a VLANs
Se identificó un error común: no asignar los puertos a las VLANs correspondientes. El profesor mostró que utilizando `show vlan brief` se puede verificar que los puertos estén correctamente asignados.

## 4. Link Aggregation (Agregación de enlaces)

### Concepto y beneficios
Se explicó que Link Aggregation permite combinar múltiples conexiones físicas entre dos switches para:
- Aumentar el ancho de banda disponible
- Proporcionar redundancia
- Balancear la carga

### Configuración de Link Aggregation
Se mostró la configuración en ambos extremos:

**Primer switch (modo activo)**:
```
Switch# configure terminal
Switch(config)# interface range fa0/10-11
Switch(config-if-range)# channel-group 1 mode active
```

**Segundo switch (modo pasivo)**:
```
Switch# configure terminal
Switch(config)# interface range fa0/10-11
Switch(config-if-range)# channel-group 1 mode passive
```

Se explicó que el modo "active" inicia la negociación, mientras que el modo "passive" responde a las solicitudes de negociación.

## 5. Consideraciones prácticas y escenarios reales

### VLAN nativa
Se explicó que la VLAN nativa (generalmente la VLAN 1) es donde se coloca todo el tráfico no etiquetado, y que por defecto todos los puertos de un switch nuevo pertenecen a esta VLAN.

### Consejos para detección de problemas
Se destacaron varios aspectos importantes para la resolución de problemas:
1. **Verificación de asignación de puertos**: Usar regularmente `show vlan brief`
2. **Comprobación de modo de puerto**: Asegurarse de que los puertos estén configurados como "access" o "trunk" según corresponda
3. **Coherencia en la configuración**: Mantener una configuración coherente en todos los dispositivos de la red

### Conexión física al switch
Se explicó que para configurar un switch físico se utiliza el puerto de consola (RS-232) conectando desde un ordenador mediante un cable de consola, y se accede a través de programas como PuTTY con configuraciones específicas (velocidad, paridad, bits de parada).

## 6. Próximas actividades

### Práctica futura
El profesor anunció que en las próximas sesiones:
1. Se profundizará en la configuración de enlaces troncales
2. Se trabajará con enrutamiento entre VLANs
3. Se configurarán servicios DHCP y DNS para VLANs

### Ejercicio evaluativo
Se mencionó la preparación de un esquema de red para que los estudiantes configuren:
- VLANs específicas
- Seguridad del switch
- Enlaces troncales
- Conectividad entre dispositivos

### Recursos adicionales
El profesor confirmó que subiría a la plataforma:
- La presentación con los comandos
- Archivos de Packet Tracer con los ejemplos trabajados
- Una lista completa de comandos Cisco para referencia

---

La tutoría logró proporcionar una visión práctica sobre la configuración de VLANs en entornos Cisco, reforzando los conceptos teóricos vistos en la clase anterior y preparando a los estudiantes para escenarios más complejos que incluirán enrutamiento entre VLANs y configuración de servicios de red. Se destacó la importancia de comprender los fundamentos antes de avanzar a configuraciones más complejas.